tap "heroku/brew"
tap "oven-sh/bun"
tap "reviewdog/tap"
brew "act"
brew "xz"
brew "openssl@3"
brew "sqlite"
brew "python@3.13"
brew "awscli"
brew "bash"
brew "biome"
brew "node"
brew "ccusage"
brew "chroma"
brew "cmake"
brew "docker-compose"
brew "duti"
brew "eslint"
brew "eslint_d"
brew "eza"
brew "flac"
brew "srt"
brew "ffmpeg"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "handbrake"
brew "jq"
brew "lefthook"
brew "liblo"
brew "mas"
brew "netlify-cli"
brew "prettier"
brew "ruby"
brew "ruff"
brew "rust"
brew "scrcpy"
brew "speedtest-cli"
brew "taplo"
brew "terminal-notifier"
brew "tree"
brew "uv"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
brew "reviewdog/tap/reviewdog"
cask "angry-ip-scanner"
cask "anydesk"
cask "audacity"
cask "betterdisplay"
cask "chatgpt"
cask "claude"
cask "clipy"
cask "cloudflare-warp"
cask "cursor"
cask "deepl"
cask "discord"
cask "distroav"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "ff-works"
cask "firefox"
cask "flutter"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-plemol-jp-nf"
cask "gcloud-cli"
cask "git-credential-manager"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "iterm2"
cask "keycastr"
cask "kiro"
cask "libndi"
cask "logi-options+"
cask "loopback"
cask "macs-fan-control"
cask "ndi-tools"
cask "nextcloud"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "ogdesign-eagle"
cask "parsec"
cask "postman"
cask "powershell"
cask "qbittorrent"
cask "rar"
cask "resolume-arena"
cask "slack"
cask "spotify"
cask "steam"
cask "tailscale-app"
cask "teamviewer"
cask "temurin"
cask "termius"
cask "the-unarchiver"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "windows-app"
cask "zoom"
mas "AmorphousDiskMark", id: 1168254295
mas "AmorphousMemoryMark", id: 1495719766
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Disk Space Analyzer", id: 446243721
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
