tap "oven-sh/bun"
tap "reviewdog/tap"
brew "act"
brew "actionlint"
brew "aws-shell"
brew "awscli"
brew "bash"
brew "bento4"
brew "biome"
brew "ccusage"
brew "chroma"
brew "chrome-devtools-mcp"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "cmake"
brew "codex"
brew "curl"
brew "docker-compose"
brew "duti"
brew "eslint_d"
brew "eslint"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "flac"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "git"
brew "gitleaks"
brew "go"
brew "handbrake"
brew "heroku"
brew "jq"
brew "lefthook"
brew "liblo"
brew "mas"
brew "mysql"
brew "netlify-cli"
brew "nginx"
brew "node"
brew "numpy"
brew "oh-my-posh"
brew "ollama"
brew "openssl@3"
brew "oven-sh/bun/bun"
brew "perl"
brew "php"
brew "postgresql@14"
brew "prettier"
brew "python@3.13"
brew "qt"
brew "redis"
brew "reviewdog/tap/reviewdog"
brew "ruby"
brew "ruff"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "sqlite"
brew "srt"
brew "svt-av1"
brew "taplo"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "uv"
brew "vite"
brew "wget"
brew "xz"
brew "yamlfix"
brew "yamlfmt"
brew "yamllint"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"
cask "1password-cli"
cask "1password"
cask "angry-ip-scanner"
cask "anydesk"
cask "audacity"
cask "betterdisplay"
cask "chatgpt"
cask "chromedriver"
cask "claude-code"
cask "claude"
cask "clipy"
cask "cloudflare-warp"
cask "companion"
cask "cursor"
cask "deepl"
cask "discord"
cask "distroav"
cask "docker-desktop"
cask "drawio"
cask "dropbox"
cask "electron"
cask "ff-works"
cask "firefox"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "font-hackgen"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-plemol-jp"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "gstreamer-runtime"
cask "handbrake-app"
cask "iterm2"
cask "keycastr"
cask "kiro"
cask "libndi"
cask "logi-options+"
cask "loopback"
cask "macs-fan-control"
cask "makemkv"
cask "mp3tag"
cask "ndi-tools"
cask "nextcloud"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "ogdesign-eagle"
cask "parsec"
cask "postman"
cask "powershell"
cask "prisma-studio"
cask "qbittorrent"
cask "rar"
cask "resolume-arena"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "svp"
cask "tailscale-app"
cask "teamviewer"
cask "temurin"
cask "termius"
cask "the-unarchiver"
cask "tor-browser"
cask "touchosc-bridge"
cask "touchosc"
cask "tourbox-console"
cask "unity-hub"
cask "unity"
cask "visual-studio-code"
cask "vlc"
cask "windows-app"
cask "wine-stable"
cask "wireshark-app"
cask "zoom"
mas "AdBlock", id: 1402042596
mas "AmorphousDiskMark", id: 1168254295
mas "AmorphousMemoryMark", id: 1495719766
mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Disk Space Analyzer", id: 446243721
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
